# vim:ft=ruby:

# Taps
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'
tap 'homebrew/services'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'universal-ctags/universal-ctags'

# Brews
brew 'git', args: ['without-completions']
brew 'python'
brew 'python3'
brew 'coreutils'
brew 'curl'
brew 'diff-so-fancy'
brew 'editorconfig'
brew 'exa'
brew 'ffmpeg'
brew 'fortune'
brew 'fzf'
brew 'git-flow-avh'
brew 'gnu-sed'
brew 'gnupg2'
brew 'grep'
brew 'htop'
brew 'highlight'
brew 'hub'
brew 'jq'
brew 'less'
brew 'mas'
brew 'nginx'
brew 'nvm'
brew 'neovim', ARGS: ['HEAD']
brew 'perl'
brew 'php71'
brew 'php71-mcrypt'
brew 'composer'
brew 'php-code-sniffer'
brew 'php-cs-fixer'
brew 'phpmd'
brew 'rbenv'
brew 'ssh-copy-id'
brew 'stow'
brew 'subliminal'
brew 'switchaudio-osx'
brew 'tldr'
brew 'tmux'
brew 'transcrypt'
brew 'tree'
brew 'universal-ctags', args: ['HEAD']
brew 'unrar'
brew 'vim', args: ['with-python2', 'with-override-system-vi']
brew 'watch'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-completions'

# Casks
cask '1password-beta'
cask 'aerial'
cask 'atom'
cask 'cleanmymac'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fira-mono-for-powerline'
cask 'font-fira-sans'
cask 'font-inconsolata'
cask 'font-iosevka'
cask 'google-chrome'
cask 'itau'
cask 'iterm2-nightly'
cask 'keka'
cask 'keybase'
cask 'ksdiff'
cask 'launchbar'
cask 'macdown'
cask 'polymail'
cask 'qlstephen'
cask 'quicklook-json'
cask 'robomongo'
cask 'sequel-pro'
cask 'skitch'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'transmission'
cask 'ubersicht'
cask 'whatsapp'
cask 'ynab'


# Mas
mas 'Sip', id: 507257563
mas 'Telegram', id: 747648890
mas 'Tweetbot', id: 557168941
mas 'Magnet', id: 441258766
