#  vim: set ft=ruby:

tap "devhubapp/devhub"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jason0x43/neovim-nightly"
tap "universal-ctags/universal-ctags"
tap "warrensbox/tap"
brew "aria2" # Download with resuming and segmented downloading
brew "bash" # Bourne-Again SHell, a UNIX command interpreter
brew "bat" # Clone of cat(1) with syntax highlighting and Git integration
brew "coreutils" # GNU File, Shell, and Text utilities
brew "curl" # Get a file from an HTTP, HTTPS or FTP server
brew "diff-so-fancy" # Good-lookin' diffs with diff-highlight and more
brew "direnv" # Load/unload environment variables based on $PWD
brew "editorconfig" # Maintain consistent coding style between multiple editors
# brew "exa" # Modern replacement for 'ls'
brew "fd" # Simple, fast and user-friendly alternative to find
brew "ffmpeg" # Play, record, convert, and stream audio and video
brew "findutils" # Collection of GNU find, xargs, and locate
brew "fzf" # Command-line fuzzy finder written in Go
brew "gawk" # GNU awk utility
brew "gcc" # GNU compiler collection
brew "git" # Distributed revision control system
brew "gnu-sed" # GNU implementation of the famous stream editor
brew "gnupg" # GNU Pretty Good Privacy (PGP) package
brew "grep" # GNU grep, egrep and fgrep
brew "highlight" # Convert source code to formatted text with syntax highlighting
brew "htop" # Improved top (interactive process viewer)
brew "hub" # Add GitHub support to git on the command-line
brew "jq" # Lightweight and flexible command-line JSON processor
brew "less" # Pager program similar to more
brew "lesspipe" # Input filter for the pager less
brew "lsd" # Replacement for 'ls'
brew "lua" # Powerful, lightweight programming language
brew "node" # Platform built on V8 to build network applications
brew "pinentry" # Passphrase entry dialog utilizing the Assuan protocol
brew "python" # Interpreted, interactive, object-oriented programming language
brew "python@2" # Interpreted, interactive, object-oriented programming language
brew "ripgrep" # Search tool like grep and The Silver Searcher
brew "ruby" # Powerful, clean, object-oriented scripting language
brew "shellcheck" # Static analysis and lint tool, for (ba)sh scripts
brew "shfmt" # Autoformat shell script source code
brew "ssh-copy-id" # Add a public key to a remote machine's authorized_keys file
brew "starship" # prompt written in rust https://starship.rs/
brew "stow" # Organize software neatly under a single directory tree (e.g. /usr/local)
brew "tldr" # Simplified and community-driven man pages
brew "tmux" # Terminal multiplexer
brew "transcrypt" # Configure transparent encryption of files in a Git repo
brew "tree" # Display directories as trees (with optional color/HTML output)
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD", "with-jansson"] # Maintained ctags implementation
brew "unrar" # Extract, view, and test RAR archives
brew "vim" # Vi 'workalike' with many additional features
brew "warrensbox/tap/tfswitch" # The tfswitch command lets you switch between terraform versions.
brew "wget" # Internet file retriever
brew "yarn" # JavaScript package manager
brew "youtube-dl" # Download YouTube videos from the command-line
brew "zsh" # UNIX shell (command interpreter)
cask "aerial"
cask "brave-browser"
cask "docker"
cask "figma"
cask "firefox-developer-edition"
cask "font-ibm-plex"
cask "font-victor-mono"
cask "fsnotes"
cask "google-chrome"
cask "iterm2"
cask "karabiner-elements"
cask "keybase"
cask "launchbar"
cask "macdown"
cask "ngrok"
cask "postman"
cask "rocket"
cask "sketchup"
cask "spotify"
cask "steam"
cask "virtualbox"
cask "devhubapp/devhub/devhub"
cask "jason0x43/neovim-nightly/neovim-nightly"
